thumb2/nrf51sdk12_3/components/softdevice/s132/headers/ble_gap.h
/**@brief Event structure for @ref BLE_GAP_EVT_SEC_PARAMS_REQUEST. */
typedef struct {
    ble_gap_sec_params_t peer_params;             /**< Initiator Security Parameters. */
} ble_gap_evt_sec_params_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SEC_INFO_REQUEST. */
typedef struct {
    ble_gap_addr_t      peer_addr;                     /**< Bluetooth address of the peer device. */
    ble_gap_master_id_t master_id;                     /**< Master Identification for LTK lookup. */
    uint8_t             enc_info  : 1;                 /**< If 1, Encryption Information required. */
    uint8_t             id_info   : 1;                 /**< If 1, Identity Information required. */
    uint8_t             sign_info : 1;                 /**< If 1, Signing Information required. */
} ble_gap_evt_sec_info_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_PASSKEY_DISPLAY. */
typedef struct {
    uint8_t passkey[BLE_GAP_PASSKEY_LEN];         /**< 6-digit passkey in ASCII ('0'-'9' digits only). */
    uint8_t match_request : 1;                    /**< If 1 requires the application to report the match using @ref sd_ble_gap_auth_key_reply
                                                     with either @ref BLE_GAP_AUTH_KEY_TYPE_NONE if there is no match or
                                                     @ref BLE_GAP_AUTH_KEY_TYPE_PASSKEY if there is a match. */
} ble_gap_evt_passkey_display_t;

/**@brief Event structure for @ref BLE_GAP_EVT_KEY_PRESSED. */
typedef struct {
    uint8_t kp_not;         /**< Keypress notification type, see @ref BLE_GAP_KP_NOT_TYPES. */
} ble_gap_evt_key_pressed_t;


/**@brief Event structure for @ref BLE_GAP_EVT_AUTH_KEY_REQUEST. */
typedef struct {
    uint8_t key_type;                             /**< See @ref BLE_GAP_AUTH_KEY_TYPES. */
} ble_gap_evt_auth_key_request_t;

/**@brief Event structure for @ref BLE_GAP_EVT_LESC_DHKEY_REQUEST. */
typedef struct {
    ble_gap_lesc_p256_pk_t *p_pk_peer;  /**< LE Secure Connections remote P-256 Public Key. This will point to the application-supplied memory
                                           inside the keyset during the call to @ref sd_ble_gap_sec_params_reply. */
    uint8_t oobd_req       :1;          /**< LESC OOB data required. A call to @ref sd_ble_gap_lesc_oob_data_set is required to complete the procedure. */
} ble_gap_evt_lesc_dhkey_request_t;


/**@brief Security levels supported.
 * @note See Bluetooth Specification Version 4.2 Volume 3, Part C, Chapter 10, Section 10.2.1.
*/
typedef struct {
    uint8_t lv1 : 1;                              /**< If 1: Level 1 is supported. */
    uint8_t lv2 : 1;                              /**< If 1: Level 2 is supported. */
    uint8_t lv3 : 1;                              /**< If 1: Level 3 is supported. */
    uint8_t lv4 : 1;                              /**< If 1: Level 4 is supported. */
} ble_gap_sec_levels_t;


/**@brief Encryption Key. */
typedef struct {
    ble_gap_enc_info_t    enc_info;             /**< Encryption Information. */
    ble_gap_master_id_t   master_id;            /**< Master Identification. */
} ble_gap_enc_key_t;


/**@brief Identity Key. */
typedef struct {
    ble_gap_irk_t         id_info;              /**< Identity Resolving Key. */
    ble_gap_addr_t        id_addr_info;         /**< Identity Address. */
} ble_gap_id_key_t;


/**@brief Security Keys. */
typedef struct {
    ble_gap_enc_key_t      *p_enc_key;           /**< Encryption Key, or NULL. */
    ble_gap_id_key_t       *p_id_key;            /**< Identity Key, or NULL. */
    ble_gap_sign_info_t    *p_sign_key;          /**< Signing Key, or NULL. */
    ble_gap_lesc_p256_pk_t *p_pk;                /**< LE Secure Connections P-256 Public Key. When in debug mode the application must use the value defined
                                                    in the Core Bluetooth Specification v4.2 Vol.3, Part H, Section 2.3.5.6.1 */
} ble_gap_sec_keys_t;


/**@brief Security key set for both local and peer keys. */
typedef struct {
    ble_gap_sec_keys_t            keys_own;     /**< Keys distributed by the local device. For LE Secure Connections the encryption key will be generated locally and will always be stored if bonding. */
    ble_gap_sec_keys_t            keys_peer;    /**< Keys distributed by the remote device. For LE Secure Connections, p_enc_key must always be NULL. */
} ble_gap_sec_keyset_t;


/**@brief Event structure for @ref BLE_GAP_EVT_AUTH_STATUS. */
typedef struct {
    uint8_t               auth_status;            /**< Authentication status, see @ref BLE_GAP_SEC_STATUS. */
    uint8_t               error_src : 2;          /**< On error, source that caused the failure, see @ref BLE_GAP_SEC_STATUS_SOURCES. */
    uint8_t               bonded : 1;             /**< Procedure resulted in a bond. */
    ble_gap_sec_levels_t  sm1_levels;             /**< Levels supported in Security Mode 1. */
    ble_gap_sec_levels_t  sm2_levels;             /**< Levels supported in Security Mode 2. */
    ble_gap_sec_kdist_t   kdist_own;              /**< Bitmap stating which keys were exchanged (distributed) by the local device. If bonding with LE Secure Connections, the enc bit will be always set. */
    ble_gap_sec_kdist_t   kdist_peer;             /**< Bitmap stating which keys were exchanged (distributed) by the remote device. If bonding with LE Secure Connections, the enc bit will never be set. */
} ble_gap_evt_auth_status_t;


/**@brief Event structure for @ref BLE_GAP_EVT_CONN_SEC_UPDATE. */
typedef struct {
    ble_gap_conn_sec_t conn_sec;                  /**< Connection security level. */
} ble_gap_evt_conn_sec_update_t;


/**@brief Event structure for @ref BLE_GAP_EVT_TIMEOUT. */
typedef struct {
    uint8_t src;                                  /**< Source of timeout event, see @ref BLE_GAP_TIMEOUT_SOURCES. */
} ble_gap_evt_timeout_t;


/**@brief Event structure for @ref BLE_GAP_EVT_RSSI_CHANGED. */
typedef struct {
    int8_t  rssi;                               /**< Received Signal Strength Indication in dBm. */
} ble_gap_evt_rssi_changed_t;


/**@brief Event structure for @ref BLE_GAP_EVT_ADV_REPORT. */
typedef struct {
    ble_gap_addr_t peer_addr;                     /**< Bluetooth address of the peer device. If the peer_addr resolved: @ref ble_gap_addr_t::addr_id_peer is set to 1
                                                     and the address is the device's identity address. */
    ble_gap_addr_t direct_addr;                   /**< Set when the scanner is unable to resolve the private resolvable address of the initiator
                                                     field of a directed advertisement packet and the scanner has been enabled to report this in @ref ble_gap_scan_params_t::adv_dir_report. */
    int8_t         rssi;                          /**< Received Signal Strength Indication in dBm. */
    uint8_t        scan_rsp : 1;                  /**< If 1, the report corresponds to a scan response and the type field may be ignored. */
    uint8_t        type     : 2;                  /**< See @ref BLE_GAP_ADV_TYPES. Only valid if the scan_rsp field is 0. */
    uint8_t        dlen     : 5;                  /**< Advertising or scan response data length. */
    uint8_t        data[BLE_GAP_ADV_MAX_SIZE];    /**< Advertising or scan response data. */
} ble_gap_evt_adv_report_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SEC_REQUEST. */
typedef struct {
    uint8_t    bond       : 1;                       /**< Perform bonding. */
    uint8_t    mitm       : 1;                       /**< Man In The Middle protection requested. */
    uint8_t    lesc       : 1;                       /**< LE Secure Connections requested. */
    uint8_t    keypress   : 1;                       /**< Generation of keypress notifications requested. */
} ble_gap_evt_sec_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST. */
typedef struct {
    ble_gap_conn_params_t conn_params;            /**<  GAP Connection Parameters. */
} ble_gap_evt_conn_param_update_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SCAN_REQ_REPORT. */
typedef struct {
    int8_t                  rssi;              /**< Received Signal Strength Indication in dBm. */
    ble_gap_addr_t          peer_addr;         /**< Bluetooth address of the peer device. If the peer_addr resolved: @ref ble_gap_addr_t::addr_id_peer is set to 1
                                                  and the address is the device's identity address. */
} ble_gap_evt_scan_req_report_t;


/**@brief GAP event structure. */
typedef struct {
    uint16_t conn_handle;                                     /**< Connection Handle on which event occurred. */
    union {                                                   /**< union alternative identified by evt_id in enclosing struct. */
        ble_gap_evt_connected_t                   connected;                    /**< Connected Event Parameters. */
        ble_gap_evt_disconnected_t                disconnected;                 /**< Disconnected Event Parameters. */
        ble_gap_evt_conn_param_update_t           conn_param_update;            /**< Connection Parameter Update Parameters. */
        ble_gap_evt_sec_params_request_t          sec_params_request;           /**< Security Parameters Request Event Parameters. */
        ble_gap_evt_sec_info_request_t            sec_info_request;             /**< Security Information Request Event Parameters. */
        ble_gap_evt_passkey_display_t             passkey_display;              /**< Passkey Display Event Parameters. */
        ble_gap_evt_key_pressed_t                 key_pressed;                  /**< Key Pressed Event Parameters. */
        ble_gap_evt_auth_key_request_t            auth_key_request;             /**< Authentication Key Request Event Parameters. */
        ble_gap_evt_lesc_dhkey_request_t          lesc_dhkey_request;           /**< LE Secure Connections DHKey calculation request. */
        ble_gap_evt_auth_status_t                 auth_status;                  /**< Authentication Status Event Parameters. */
        ble_gap_evt_conn_sec_update_t             conn_sec_update;              /**< Connection Security Update Event Parameters. */
        ble_gap_evt_timeout_t                     timeout;                      /**< Timeout Event Parameters. */
        ble_gap_evt_rssi_changed_t                rssi_changed;                 /**< RSSI Event parameters. */
        ble_gap_evt_adv_report_t                  adv_report;                   /**< Advertising Report Event Parameters. */
        ble_gap_evt_sec_request_t                 sec_request;                  /**< Security Request Event Parameters. */
        ble_gap_evt_conn_param_update_request_t   conn_param_update_request;    /**< Connection Parameter Update Parameters. */
        ble_gap_evt_scan_req_report_t             scan_req_report;              /**< Scan Request Report parameters. */
    } params;                                                                 /**< Event Parameters. */
} ble_gap_evt_t;


